In [12]:
import pandas as pd
import numpy as np

In [13]:
data_one = {'A':['A0','A1','A2','A3'],'B':['B0','B1','B2','B3']}
data_two = {'C':['C0','C1','C2','C3'],'D':['D0','D1','D2','D3']}

one = pd.DataFrame(data_one)
two = pd.DataFrame(data_two)

In [14]:
pd.concat([one,two] , axis=1)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [15]:
two.columns = one.columns
two

    A   B
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [16]:
reg = pd.DataFrame({'reg_id':[1,2,3,4],'name':['Andrew','Bobo','Claire','David']})
log = pd.DataFrame({'log_id':[1,2,3,4],'name':['Xavier','Andrew','Yolanda','Bobo']})

In [17]:
reg , log

(   reg_id    name
 0       1  Andrew
 1       2    Bobo
 2       3  Claire
 3       4   David,
    log_id     name
 0       1   Xavier
 1       2   Andrew
 2       3  Yolanda
 3       4     Bobo)

In [18]:
pd.merge(reg,log, how= 'inner' , on = 'name')

   reg_id    name  log_id
0       1  Andrew       2
1       2    Bobo       4

In [ ]:
# merge but only show names of left dataset
pd.merge(left = reg , right = log , how = 'left',on = 'name' )

   reg_id    name  log_id
0       1  Andrew     2.0
1       2    Bobo     4.0
2       3  Claire     NaN
3       4   David     NaN

In [30]:
mer1 = pd.merge(left = reg , right = log , how = 'outer',on = 'name' )

In [28]:
mer = pd.concat([reg,log], axis=1)

In [29]:
mer.set_index('name')

                   reg_id  log_id
name
(Andrew, Xavier)        1       1
(Bobo, Andrew)          2       2
(Claire, Yolanda)       3       3
(David, Bobo)           4       4

In [31]:
mer1.set_index('name')

         reg_id  log_id
name
Andrew      1.0     2.0
Bobo        2.0     4.0
Claire      3.0     NaN
David       4.0     NaN
Xavier      NaN     1.0
Yolanda     NaN     3.0